{
  "summary": "Number of forward and reverse reads that support REF and ALT alleles",
  "parallel": [],
  "activeregion": {},
  "partitiontype": "",
  "walkertype": "",
  "arguments": [],
  "refwindow": {},
  "description": "\n\n \u003cp\u003eStrand bias is a type of sequencing bias in which one DNA strand is favored over the other, which can result in incorrect evaluation of the amount of evidence observed for one allele vs. the other. The StrandBiasBySample annotation produces read counts per allele and per strand that are used by other annotation modules (FisherStrand and StrandOddsRatio) to estimate strand bias using statistical approaches.\n\n \u003cp\u003eThis annotation produces 4 values, corresponding to the number of reads that support the following (in that order):\u003c/p\u003e\n \u003cul\u003e\n     \u003cli\u003ethe reference allele on the forward strand\u003c/li\u003e\n     \u003cli\u003ethe reference allele on the reverse strand\u003c/li\u003e\n     \u003cli\u003ethe alternate allele on the forward strand\u003c/li\u003e\n     \u003cli\u003ethe alternate allele on the reverse strand\u003c/li\u003e\n \u003c/ul\u003e\n\n \u003ch3\u003eExample\u003c/h3\u003e\n \u003cpre\u003eGT:AD:GQ:PL:SB  0/1:53,51:99:1758,0,1835:23,30,33,18\u003c/pre\u003e\n \u003cp\u003eIn this example, the reference allele is supported by 23 forward reads and 30 reverse reads, the alternate allele is supported by 33 forward reads and 18 reverse reads.\u003c/p\u003e\n\n \u003ch3\u003eCaveats\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003eThis annotation can only be generated by HaplotypeCaller (it will not work when called from VariantAnnotator).\u003c/li\u003e\n \u003c/ul\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_FisherStrand.html\"\u003eFisherStrand\u003c/a\u003e\u003c/b\u003e uses Fisher\u0027s Exact Test to evaluate strand bias.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_StrandOddsRatio.html\"\u003eStrandOddsRatio\u003c/a\u003e\u003c/b\u003e is an updated form of FisherStrand that uses a symmetric odds ratio calculation.\u003c/li\u003e\n \u003c/ul\u003e",
  "name": "StrandBiasBySample",
  "annotinfo": "",
  "readfilters": [],
  "downsampling": {},
  "group": "Variant Annotations",
  "annotfield": "FORMAT (sample genotype-level)",
  "annotdescript": [
    "FORMAT\u003d\u0026lt;ID\u003dSB,Number\u003d4,Type\u003dInteger,Description\u003d\u0026quot;Per-sample component statistics which comprise the Fisher\u0027s Exact Test to detect strand bias.\u0026quot;\u0026gt;"
  ]
}