{
  "summary": "Allele balance across all samples",
  "parallel": [],
  "activeregion": {},
  "partitiontype": "",
  "walkertype": "",
  "arguments": [],
  "refwindow": {},
  "description": "\n\n \u003cp\u003e This is an experimental annotation that attempts to estimate whether the data supporting a variant call fits allelic ratio expectations, or whether there might be some bias in the data. Each sample will contribute its allelic read depth (from the AD annotation) to either ABHom or ABHet depending on its genotype call: ABHom if the call is homozygous (REF/REF or ALT/ALT), and ABHet if the call is heterozygous (REF/ALT). Additionally, reads that support something other than the genotyped alleles (called \"non-alleles\") will be counted in the OND tag, which represents the overall fraction of data that diverges from the diploid hypothesis.\u003c/p\u003e\n \u003ch3\u003eCalculations\u003c/h3\u003e\n \u003cp\u003e $$ ABHom \u003d \\frac{# ALT alleles}{total # alleles} $$ \u003cbr /\u003e\n     $$ ABHet \u003d \\frac{# REF alleles}{# total alleles} $$ \u003cbr /\u003e\n     $$ OND \u003d \\frac{# genotyped alleles}{# alleles + # non-alleles} $$\n \u003c/p\u003e\n \u003cp\u003e For ABHom, the value should be close to 1.00 because ideally, all the reads should support a single allele. For ABHet, the value should be close to 0.5, so half of the alleles support the ref allele and half of the alleles support the alt allele. Divergence from these expected ratios may indicate that there is some bias in favor of one allele. Note the caveats below regarding cancer and RNAseq analysis. \u003c/p\u003e\n \u003ch3\u003eCaveats\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003eThis annotation will only work properly for biallelic variants where all samples are called heterozygous or homozygous.\u003c/li\u003e\n     \u003cli\u003eThis annotation cannot currently be calculated for indels.\u003c/li\u003e\n     \u003cli\u003etThe reasoning underlying this annotation only applies to germline variants in DNA sequencing data. In somatic/cancer analysis, divergent ratios are expected due to tumor heterogeneity. In RNAseq analysis, divergent ratios may indicate differential allele expression.\u003c/li\u003e\n     \u003cli\u003eAs stated above, this annotation is experimental and should be interpreted with caution as we cannot guarantee that it is appropriate. Basically, use it at your own risk.\u003c/li\u003e\n \u003c/ul\u003e\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_AlleleBalanceBySample.html\"\u003eAlleleBallanceBySample\u003c/a\u003e\u003c/b\u003e calculates allele balance for each individual sample.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_DepthPerAlleleBySample.html\"\u003eDepthPerAlleleBySample\u003c/a\u003e\u003c/b\u003e calculates depth of coverage for each allele per sample.\u003c/li\u003e\n \u003c/ul\u003e",
  "name": "AlleleBalance",
  "annotinfo": "",
  "readfilters": [],
  "downsampling": {},
  "group": "Variant Annotations",
  "annotfield": "INFO (variant-level)",
  "annotdescript": [
    "INFO\u003d\u0026lt;ID\u003dABHet,Number\u003d1,Type\u003dFloat,Description\u003d\u0026quot;Allele Balance for heterozygous calls (ref/(ref+alt))\u0026quot;\u0026gt;",
    "INFO\u003d\u0026lt;ID\u003dABHom,Number\u003d1,Type\u003dFloat,Description\u003d\u0026quot;Allele Balance for homozygous calls (A/(A+O)) where A is the allele (ref or alt) and O is anything other\u0026quot;\u0026gt;",
    "INFO\u003d\u0026lt;ID\u003dOND,Number\u003d1,Type\u003dFloat,Description\u003d\u0026quot;Overall non-diploid ratio (alleles/(alleles+non-alleles))\u0026quot;\u0026gt;"
  ]
}