{
  "summary": "Rank Sum Test for mapping qualities of REF versus ALT reads",
  "parallel": [],
  "activeregion": {},
  "partitiontype": "",
  "walkertype": "",
  "arguments": [],
  "refwindow": {},
  "description": "\n\n \u003cp\u003eThis variant-level annotation compares the mapping qualities of the reads supporting the reference allele with those supporting the alternate allele. The ideal result is a value close to zero, which indicates there is little to no difference. A negative value indicates that the reads supporting the alternate allele have lower mapping quality scores than those supporting the reference allele. Conversely, a positive value indicates that the reads supporting the alternate allele have higher mapping quality scores than those supporting the reference allele.\u003c/p\u003e\n \u003cp\u003eThis annotation can be used to evaluate confidence in a variant call and is a recommended covariate for variant recalibration (VQSR). Finding a statistically significant difference in quality either way suggests that the sequencing and/or mapping process may have been biased or affected by an artifact. In practice, we only filter out low negative values when evaluating variant quality because the idea is to filter out variants for which the quality of the data supporting the alternate allele is comparatively low. The reverse case, where it is the quality of data supporting the reference allele that is lower (resulting in positive ranksum scores), is not really informative for filtering variants.\n\n \u003ch3\u003eStatistical notes\u003c/h3\u003e\n \u003cp\u003eThe value output for this annotation is the u-based z-approximation from the Mann-Whitney-Wilcoxon Rank Sum Test for mapping qualities (MAPQ of reads supporting REF vs. MAPQ of reads supporting ALT). See the \u003ca href\u003d\"http://www.broadinstitute.org/gatk/guide/article?id\u003d8031\"\u003emethod document on statistical tests\u003c/a\u003e for a more detailed explanation of the ranksum test.\u003c/p\u003e\n\n \u003ch3\u003eCaveats\u003c/h3\u003e\n \u003cul\u003e\u003cli\u003eThe mapping quality rank sum test can not be calculated for sites without a mixture of reads showing both the reference and alternate alleles.\u003c/li\u003e\n \u003cli\u003eUninformative reads are not used in these annotations.\u003c/li\u003e\n \u003c/ul\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_AS_MappingQualityRankSumTest.html\"\u003eAS_MappingQualityRankSumTest\u003c/a\u003e\u003c/b\u003e outputs an allele-specific version of this annotation.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_AS_MQMateRankSumTest.html\"\u003eAS_MQMateRankSumTest\u003c/a\u003e\u003c/b\u003e outputs the allele-specific rank sum test on the mapping quality of the reads\u0027 mates rather than the reads themselves.\u003c/li\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_RMSMappingQuality.html\"\u003eRMSMappingQuality\u003c/a\u003e\u003c/b\u003e gives an estimation of the overal read mapping quality supporting a variant call.\u003c/li\u003e\n \u003c/ul\u003e",
  "name": "MappingQualityRankSumTest",
  "annotinfo": "StandardAnnotation, ActiveRegionBasedAnnotation",
  "readfilters": [],
  "downsampling": {},
  "group": "Annotation Modules",
  "annotfield": "INFO (variant-level)",
  "annotdescript": [
    "INFO\u003d\u0026lt;ID\u003dMQRankSum,Number\u003d1,Type\u003dFloat,Description\u003d\u0026quot;Z-score From Wilcoxon rank sum test of Alt vs. Ref read mapping qualities\u0026quot;\u0026gt;"
  ]
}