{
  "summary": "Likelihood of being a Mendelian Violation",
  "parallel": [],
  "activeregion": {},
  "partitiontype": "",
  "walkertype": "",
  "arguments": [],
  "refwindow": {},
  "description": "\n\n \u003cp\u003eThis annotation uses the likelihoods of the genotype calls to assess whether a site is transmitted from parents to offspring according to Mendelian rules. The output is the likelihood of the site being a Mendelian violation, which can be tentatively interpreted either as an indication of error (in the genotype calls) or as a possible \u003cem\u003e\u003cde novo\u003c/em\u003e mutation. The higher the output value, the more likely there is to be a Mendelian violation. Note that only positive values indicating likely MVs will be annotated; if the value for a given site is negative (indicating that there is no violation) the annotation is not written to the file.\u003c/p\u003e\n\n \u003ch3\u003eStatistical notes\u003c/h3\u003e\n \u003cp\u003eThis annotation considers all possible combinations of all possible genotypes (homozygous-reference, heterozygous, and homozygous-variant) for each member of a trio, which amounts to 27 possible combinations. Using the Phred-scaled genotype likelihoods (PL values) from each individual, the likelihood of each combination is calculated, and the result contributes to the likelihood of the corresponding case (mendelian violation or non-violation) depending on which set it belongs to. See the \u003ca href\u003d\"http://www.broadinstitute.org/gatk/guide/article?id\u003d4732\"\u003emethod document on statistical tests\u003c/a\u003e for a more detailed explanation of this statistical test.\u003c/p\u003e\n\n \u003ch3\u003eCaveats\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003eThe calculation assumes that the organism is diploid.\u003c/li\u003e\n     \u003cli\u003eThis annotation requires a valid pedigree file.\u003c/li\u003e\n     \u003cli\u003eWhen multiple trios are present, the annotation is simply the maximum of the likelihood ratios, rather than the strict 1-Prod(1-p_i) calculation, as this can scale poorly for uncertain sites and many trios.\u003c/li\u003e\n     \u003cli\u003eThis annotation can only be used from the VariantAnnotator. If you attempt to use it from the UnifiedGenotyper, the run will fail with an error message to that effect. If you attempt to use it from the HaplotypeCaller, the run will complete successfully but the annotation will not be added to any variants.\u003c/li\u003e\n \u003c/ul\u003e\n\n \u003ch3\u003eRelated annotations\u003c/h3\u003e\n \u003cul\u003e\n     \u003cli\u003e\u003cb\u003e\u003ca href\u003d\"https://www.broadinstitute.org/gatk/guide/tooldocs/org_broadinstitute_gatk_tools_walkers_annotator_PossibleDeNovo.html\"\u003ePossibleDeNovo\u003c/a\u003e\u003c/b\u003e annotates the existence of a de novo mutation in at least one of a set of families/trios.\u003c/li\u003e\n \u003c/ul\u003e",
  "name": "MVLikelihoodRatio",
  "annotinfo": "RodRequiringAnnotation",
  "readfilters": [],
  "downsampling": {},
  "group": "Annotation Modules",
  "annotfield": "INFO (variant-level)",
  "annotdescript": [
    "INFO\u003d\u0026lt;ID\u003dMVLR,Number\u003d1,Type\u003dFloat,Description\u003d\u0026quot;Mendelian violation likelihood ratio: L[MV] - L[No MV]\u0026quot;\u0026gt;"
  ]
}